; domain
(define (domain bubble-making-simple)
  (:requirements :strips :typing)

  (:types
    person tool material container bubble - object
    location
  )

  (:predicates
    ;; 位置相关谓词
    (in ?obj - object ?cont - container)
    (at_location ?obj - object ?loc - location)

    ;; 状态相关谓词
    (mixed ?mixture - material)
    (enhanced ?mixture - material)
    (have_wand ?p - person ?t - tool)
    (served_bubble ?b - bubble)
    (in_air ?b - bubble)
    (wet ?t - tool)
    (outside ?p - person)
  )

  ;; 动作1：混合肥皂和水
  (:action mix_soap_and_water
    :parameters (?p - person ?soap - material ?water - material ?bowl - container ?mixture - material)
    :precondition (and
      (in ?soap ?bowl)
      (in ?water ?bowl)
      (not (mixed ?mixture))
    )
    :effect (and
      (mixed ?mixture)
      (in ?mixture ?bowl)
      (not (in ?soap ?bowl))
      (not (in ?water ?bowl))
    )
  )

  ;; 动作2：增强泡泡溶液
  (:action enhance_solution
    :parameters (?p - person ?mixture - material)
    :precondition (and
      (mixed ?mixture)
      (not (enhanced ?mixture))
    )
    :effect (enhanced ?mixture)
  )

  ;; 动作3：制作泡泡棒
  (:action make_bubble_wand
    :parameters (?p - person ?wand - tool)
    :precondition (and
      (enhanced mixture1)
      (not (have_wand ?p ?wand))
    )
    :effect (have_wand ?p ?wand)
  )

  ;; 动作4：前往户外
  (:action go_outside
    :parameters (?p - person)
    :precondition (not (outside ?p))
    :effect (outside ?p)
  )

  ;; 动作5：制作肥皂泡泡
  (:action make_bubble
    :parameters (?p - person ?wand - tool ?b - bubble)
    :precondition (and
      (have_wand ?p ?wand)
      (enhanced mixture1)
      (outside ?p)
    )
    :effect (and
      (in_air ?b)
      (wet ?wand)
      (served_bubble ?b)
    )
  )
)

; problem
(define (problem make_soap_bubbles)
  (:domain bubble-making-simple)

  (:objects
    ;; 人
    alice - person

    ;; 工具
    wand1 - tool

    ;; 材料
    soap1 water1 mixture1 - material

    ;; 容器
    bowl1 - container

    ;; 泡泡
    bubble1 - bubble

    ;; 位置
    kitchen garden - location
  )

  (:init
    ;; 初始位置
    (at_location alice kitchen)
    (at_location soap1 kitchen)
    (at_location water1 kitchen)
    (at_location bowl1 kitchen)
    (at_location wand1 kitchen)

    ;; 初始状态
    (in soap1 bowl1)
    (in water1 bowl1)
    (not (mixed mixture1))
    (not (enhanced mixture1))
    (not (have_wand alice wand1))
    (not (in_air bubble1))
    (not (wet wand1))
    (not (outside alice))
    (not (served_bubble bubble1))
  )

  (:goal (and
    (in_air bubble1)
    (served_bubble bubble1)
    (wet wand1)
    (outside alice)
  ))
)

; plan
1. (mix_soap_and_water alice soap1 soap1 bowl1 mixture1)
   deleted: (in soap1 bowl1)
   added: (mixed mixture1) (in mixture1 bowl1)
   goals met: 0 of 4
2. (enhance_solution alice mixture1)
   added: (enhanced mixture1)
   goals met: 0 of 4
3. (go_outside alice)
   added: (outside alice)
   goals met: 1 of 4
4. (make_bubble_wand alice wand1)
   added: (have_wand alice wand1)
   goals met: 1 of 4
5. (make_bubble alice wand1 bubble1)
   added: (in_air bubble1) (wet wand1) (served_bubble bubble1)
   goals met: 4 of 4
